We downgraded terraform from v1.4.x to v1.3.9 for this about 4 weeks ago, and it worked for a while.
Recently however we're starting to have a similar, but very slightly different, problem.

Our terraform sets up two separate deployments. One started showing this problem in a few days, the other just started doing it this week.

```
  ~ resource "ec_deployment" "esd" {
      ~ apm_secret_token       = (sensitive value)
      ~ elasticsearch          = {
          ~ cloud_id       = "....hidden...." -> (known after apply)
          ~ config         = {
              + plugins            = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ http_endpoint  = "http://....hidden....:9200" -> (known after apply)
          ~ https_endpoint = "https://....hidden....:443" -> (known after apply)
          ~ resource_id    = "....hidden...." -> (known after apply)
```

This is terraform v1.3.9 and elastic/ec 0.7.0.